package china_company.meituan;

/**
 * @program: danceOffer
 * @description: 链接：https://www.nowcoder.com/questionTerminal/ed3e16c8ec8643f3a720b70f9936fd65 来源：牛客网
 * 【黑客入侵点定位】集团内部有一核心机密项目，共由150个代码模块按顺序串行执行组成（示例：模块1->模块2->…模块N…->模块149->模块150)。
 * 偶然一天，某一个模块突然被黑客入侵（当前模块也称入侵点）。
 * 因为内部已经有预防措施，现存两款从不同角度设计的反入侵检测程序，但同时也有一定检测限制：
 * 1.输入：顺序代码段，必须以模块1开始（比如：模块1->模块2->…模块39）
 * 2:输出：True-输入包含入侵点，False-输入不包含入侵点
 * 3.每款检测程序可以运行多次：可多次返回False,但仅能返回一次True（由于入侵的对抗性存在，一旦输出True即报废，后续检测功能失效）
 * 4.同一时刻只能有一款检测程序运行，每检测一次耗时10分钟 现在希望仅利用现有的两款反入侵检测程序，在最短的时间内确保可以快速定位入侵点。
 * 具体需要如何设计检测流程，时间是多久。
 * @author: mobing_yin
 * @create: 2020-09-03 19:44
 **/

public class S1_HeiKeRuQin {
}
